TDPortal/Utilities/EnhancedExposedServicesTestTool/ExposedServicesTestToolClient/Requests/TravelNewsService/V1/TravelNewsService_GetTravelNewsDetails - London.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <GetTravelNewsDetails xmlns="http://www.transportdirect.info/TransportDirect.EnhancedExposedServices.TravelNews.V1">
      <transactionId>GetTravelNewsDetailsTransactionId12323</transactionId>
      <language>en-GB</language>
      <travelNewsRequest>
        <TransportType>All</TransportType>
        <DelayType>All</DelayType>
	<Region>London</Region>
      </travelNewsRequest>
    </GetTravelNewsDetails>
  </soap:Body>
</soap:Envelope>