TDPortal/Utilities/EnhancedExposedServicesTestTool/ExposedServicesTestToolClient/Requests/TravelNewsService/V1/TravelNewsService_GetTravelNewsAvailableRegion.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <GetTravelNewsAvailableRegions xmlns="http://www.transportdirect.info/TransportDirect.EnhancedExposedServices.TravelNews.V1">
      <transactionId>GetTravelNewsAvailableRegionsTransactionId12323</transactionId>
      <language>en-GB</language>
    </GetTravelNewsAvailableRegions>
  </soap:Body>
</soap:Envelope>